---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternallyTaggedBRep
source: html/27fb8fd6-7ad8-cb72-c70a-a8c6a4a43ae9.htm
---
# ExternallyTaggedBRep Methods

Returns the externally tagged geometry object.